---
kind: enumMember
id: F:Autodesk.Revit.DB.FamilySizeTableErrorType.IncorrectNumberOfColumns
enum: Autodesk.Revit.DB.FamilySizeTableErrorType
source: html/daca2b01-2286-87d3-ada3-621c792b2cf4.htm
---
# Autodesk.Revit.DB.FamilySizeTableErrorType.IncorrectNumberOfColumns

The number of columns in the header row of the FamilySizeTable CSV file is different than the number of columns of data.